import json


raspisanie = {
    0:{
            "1 урок": ['Разговор о важном', "8.45 - 9.15"],
            "2 урок": ['Информатика', "9.20 - 10.05"],
            "3 урок": ['Информатика', "10.10 - 10.55"],
            "4 урок": ['Физ-ра', "11.00 - 11.45"],
            "5 урок": ['Физ-ра', "11.50 - 12.35"],
            "6 урок": ['Математика', "13.15 - 14.00"],
            "7 урок": ['Математика', "14.05 - 14.50"],
            "8 урок": ['Русский', "14.55 - 15.40"],
            "9 урок": ['Русский', "15.45 - 16.30"],
        },
    1:{
            "1 урок": ['История', "8.45 - 9.30"],
            "2 урок": ['История', "9.35 - 10.20"],
            "3 урок": ['Математика', "10.30 - 11.15"],
            "4 урок": ['Математика', "11.20 - 12.05"],
            "5 урок": ['Физика', "12.45 - 13.30"],
            "6 урок": ['Физика', "13.35 - 14.20"],
            "7 урок": ['Основы алгоритмизации', "14.30 - 15.15"],
            "8 урок": ['Основы алгоритмизации', "15.20 - 16.05"],
        },
    2:{
            "1 урок": ['Английский', "8.45 - 9.30"],
            "2 урок": ['Английский', "9.35 - 10.20"],
            "3 урок": ['Русский', "10.30 - 11.15"],
            "4 урок": ['МДК 01', "11.20 - 12.05"],
            "5 урок": ['МДК 01', "12.45 - 13.30"],
            "6 урок": ['МДК 01', "13.35 - 14.20"],
            "7 урок": ['МДК 01', "14.30 - 15.15"],
            "8 урок": ['МДК 02', "15.20 - 16.05"],
        },
    3:{
            "1 урок": ['Разговоры о важном', "8.45 - 9.15"],
            "2 урок": ['Литература', "9.20 - 10.05"],
            "3 урок": ['Литература', "10.10 - 10.55"],
            "4 урок": ['Химия', "11.00 - 11.45"],
            "5 урок": ['Химия', "11.50 - 12.35"],
            "6 урок": ['Базы данных', "13.15 - 14.00"],
            "7 урок": ['Базы данных', "14.05 - 14.50"],
            "8 урок": ['МДК 02', "14.55 - 15.40"],
            "9 урок": ['МДК 02', "15.45 - 16.30"],
        },
    4:{
            "1 урок": ['Информатика', "8.45 - 9.30"],
            "2 урок": ['Информатика', "9.35 - 10.20"],
            "3 урок": ['ОБЖ', "10.30 - 11.15"],
            "4 урок": ['ОБЖ', "11.20 - 12.05"],
        },
    5:{
            "Выходной": ['Выходной', "time0"],
        },
    6:{
            "Выходной": ['Выходной', "time0"],
        },
}

def dump_rasp():
    with open('raspisanie.json', 'w') as rasp:
        json.dump(raspisanie,rasp)
        rasp.close()


def load_rasp():
    with open('raspisanie.json', 'r') as rasp:
        raspisanie.clear()
        raspisanie = json.load(rasp)
        rasp.close()

def create_text_rasp(weekday):
    banner_text_rasp = "расписание на сегодня:\n"
    for el in raspisanie[weekday].items():
        banner_text_rasp += f"{el[0]}: {el[1][0]} время: {el[1][1]}\n"
    return banner_text_rasp